#### Terraform Initialization : success`
#### Terraform Plan : success`
<details><summary>Show Plan</summary>

```

[0m[1mdata.aws_subnets.web: Reading...[0m[0m
[0m[1mdata.aws_subnets.data: Reading...[0m[0m
[0m[1mdata.aws_subnets.app: Reading...[0m[0m
[0m[1maws_efs_file_system.ga_efs: Refreshing state... [id=fs-0bbc087d532aaa467][0m
[0m[1maws_security_group.ga_app_sg: Refreshing state... [id=sg-0aff6cea4bf8113d7][0m
[0m[1maws_security_group.ga_db_sg: Refreshing state... [id=sg-0886f96d9a9250518][0m
[0m[1maws_security_group.ga_lb_sg: Refreshing state... [id=sg-0587deb5744eb212c][0m
[0m[1maws_security_group_rule.allow_tcp_3306: Refreshing state... [id=sgrule-2039825727][0m
[0m[1maws_security_group_rule.allow_internet: Refreshing state... [id=sgrule-1212953475][0m
[0m[1maws_security_group_rule.allow_tcp_443: Refreshing state... [id=sgrule-3208287930][0m
[0m[1mdata.aws_subnets.web: Read complete after 0s [id=ca-central-1][0m
[0m[1mdata.aws_subnets.data: Read complete after 0s [id=ca-central-1][0m
[0m[1maws_lb.ga-lb: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:654654488989:loadbalancer/app/ga-issue-5-lb/1991dc38d9a4c114][0m
[0m[1maws_db_subnet_group.data: Refreshing state... [id=ga-db-issue-5-subnet-group][0m
[0m[1mdata.aws_subnets.app: Read complete after 0s [id=ca-central-1][0m
[0m[1maws_efs_access_point.ga_ap_sharedconfig: Refreshing state... [id=fsap-01ed8537da5937a13][0m
[0m[1maws_efs_access_point.ga_ap_ghttpsroot2: Refreshing state... [id=fsap-02a020798f271567d][0m
[0m[1maws_efs_access_point.ga_ap_tomcatlog2: Refreshing state... [id=fsap-007b0699e7a56d019][0m
[0m[1maws_efs_access_point.ga_ap_config1: Refreshing state... [id=fsap-06694cead17c15cde][0m
[0m[1maws_efs_access_point.ga_ap_upgrader2: Refreshing state... [id=fsap-087c8878ac1be21cc][0m
[0m[1maws_efs_mount_target.ga_efs_mount_target_1: Refreshing state... [id=fsmt-0ea508b4261662794][0m
[0m[1maws_efs_access_point.ga_ap_userdata: Refreshing state... [id=fsap-0e27ade4626d75511][0m
[0m[1maws_efs_access_point.ga_ap_root: Refreshing state... [id=fsap-0d9c293adece0a725][0m
[0m[1maws_efs_access_point.ga_ap_ghttpsroot1: Refreshing state... [id=fsap-001176ac0f6faa040][0m
[0m[1maws_efs_access_point.ga_ap_tomcatserver2: Refreshing state... [id=fsap-014ca07a679db7841][0m
[0m[1maws_efs_access_point.ga_ap_upgrader1: Refreshing state... [id=fsap-0638ba69ff9ac47f9][0m
[0m[1maws_efs_mount_target.ga_efs_mount_target_2: Refreshing state... [id=fsmt-030350c445d3f34fc][0m
[0m[1maws_efs_access_point.ga_ap_config2: Refreshing state... [id=fsap-0782bfe0ae7366428][0m
[0m[1maws_efs_access_point.ga_ap_tomcatlog1: Refreshing state... [id=fsap-041a2c9803bcef554][0m
[0m[1maws_efs_access_point.ga_ap_tomcatserver1: Refreshing state... [id=fsap-01200660879ab28b0][0m
[0m[1maws_db_instance.ga_mysql: Refreshing state... [id=db-YNGXTLUVHBWVMRFDYXY6BBBNIA][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m

Terraform will perform the following actions:

[1m  # aws_alb_listener.http-80[0m will be created
[0m  [32m+[0m[0m resource "aws_alb_listener" "http-80" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m load_balancer_arn = "arn:aws:elasticloadbalancing:ca-central-1:654654488989:loadbalancer/app/ga-issue-5-lb/1991dc38d9a4c114"
      [32m+[0m[0m port              = 80
      [32m+[0m[0m protocol          = "HTTP"
      [32m+[0m[0m ssl_policy        = (known after apply)
      [32m+[0m[0m tags_all          = (known after apply)

      [32m+[0m[0m default_action {
          [32m+[0m[0m order = (known after apply)
          [32m+[0m[0m type  = "redirect"

          [32m+[0m[0m redirect {
              [32m+[0m[0m host        = "#{host}"
              [32m+[0m[0m path        = "/#{path}"
              [32m+[0m[0m port        = "443"
              [32m+[0m[0m protocol    = "HTTPS"
              [32m+[0m[0m query       = "#{query}"
              [32m+[0m[0m status_code = "HTTP_301"
            }
        }
    }

[1m  # aws_alb_target_group.ga-tg[0m will be created
[0m  [32m+[0m[0m resource "aws_alb_target_group" "ga-tg" {
      [32m+[0m[0m arn                                = (known after apply)
      [32m+[0m[0m arn_suffix                         = (known after apply)
      [32m+[0m[0m connection_termination             = (known after apply)
      [32m+[0m[0m deregistration_delay               = "300"
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m ip_address_type                    = (known after apply)
      [32m+[0m[0m lambda_multi_value_headers_enabled = false
      [32m+[0m[0m load_balancer_arns                 = (known after apply)
      [32m+[0m[0m load_balancing_algorithm_type      = (known after apply)
      [32m+[0m[0m load_balancing_anomaly_mitigation  = (known after apply)
      [32m+[0m[0m load_balancing_cross_zone_enabled  = (known after apply)
      [32m+[0m[0m name                               = (sensitive value)
      [32m+[0m[0m name_prefix                        = (known after apply)
      [32m+[0m[0m port                               = 80
      [32m+[0m[0m preserve_client_ip                 = (known after apply)
      [32m+[0m[0m protocol                           = "HTTP"
      [32m+[0m[0m protocol_version                   = (known after apply)
      [32m+[0m[0m proxy_protocol_v2                  = false
      [32m+[0m[0m slow_start                         = 0
      [32m+[0m[0m tags_all                           = (known after apply)
      [32m+[0m[0m target_type                        = "ip"
      [32m+[0m[0m vpc_id                             = (sensitive value)

      [32m+[0m[0m health_check {
          [32m+[0m[0m enabled             = true
          [32m+[0m[0m healthy_threshold   = 3
          [32m+[0m[0m interval            = 30
          [32m+[0m[0m matcher             = "200,302"
          [32m+[0m[0m path                = "/"
          [32m+[0m[0m port                = "traffic-port"
          [32m+[0m[0m protocol            = "HTTP"
          [32m+[0m[0m timeout             = (known after apply)
          [32m+[0m[0m unhealthy_threshold = 3
        }

      [32m+[0m[0m stickiness {
          [32m+[0m[0m cookie_duration = 86400
          [32m+[0m[0m enabled         = true
          [32m+[0m[0m type            = "lb_cookie"
        }
    }

[1m  # aws_lb.ga-lb[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_lb" "ga-lb" {
        id                                                           = "arn:aws:elasticloadbalancing:ca-central-1:654654488989:loadbalancer/app/ga-issue-5-lb/1991dc38d9a4c114"
        name                                                         = (sensitive value)
        tags                                                         = {
            "Environment" = "dev"
            "Name"        = (sensitive value)
        }
        [90m# (25 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m access_logs {
          [33m~[0m[0m enabled = true [33m->[0m[0m false
            [90m# (2 unchanged attributes hidden)[0m[0m
        }

        [90m# (3 unchanged blocks hidden)[0m[0m
    }

[1mPlan:[0m 2 to add, 1 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @cedricguindon, Action: `pull_request`*